{
  "topics": [
    {
      "id": 1,
      "name": "HTML"
    },
    {
      "id": 2,
      "name": "CSS"
    },
    {
      "id": 3,
      "name": "JavaScript"
    },
    {
      "id": 4,
      "name": "React"
    },
    {
      "id": 5,
      "name": "Python"
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Olivia Brooks",
      "email": "obooks@gmail.com",
      "cohort": 76
    },
    {
      "id": 2,
      "name": "Ethan Parker",
      "email": "eparker@gmail.com",
      "cohort": 72
    },
    {
      "id": 3,
      "name": "Ava Mitchell",
      "email": "amitchell@gmail.com",
      "cohort": 73
    },
    {
      "id": 4,
      "name": "Nathan Harris",
      "email": "nharris@gmail.com",
      "cohort": 73
    },
    {
      "id": 5,
      "name": "Sophia Turner",
      "email": "sturner@gmail.com",
      "cohort": 70
    },
    {
      "id": 6,
      "name": "Liam Scott",
      "email": "lscott@gmail.com",
      "cohort": 71
    }
  ],
  "posts": [
    {
      "id": 1,
      "title": "Designing Your Website",
      "body": "CSS (Cascading Style Sheets) is a stylesheet language used to control the presentation and layout of HTML documents. It allows developers to specify how elements such as text, images, and other content are displayed on a webpage, including aspects like colors, fonts, spacing, and positioning. By separating content (HTML) from design (CSS), it promotes cleaner code, easier maintenance, and improved website performance. CSS can be applied inline, embedded within an HTML document, or linked externally, providing flexibility in web design.",
      "date": "11/16/2024",
      "userId": 6,
      "topicId": 2
    },
    {
      "id": 2,
      "title": "Learning how to React",
      "body": "React is a popular JavaScript library for building user interfaces, primarily for single-page applications. Developed by Facebook, React allows developers to create reusable UI components that manage their own state, making it easier to build dynamic and interactive web applications. It uses a virtual DOM (Document Object Model) to optimize rendering performance, ensuring a smooth user experience by only updating the parts of the page that have changed. React supports a component-based architecture and can be integrated with other libraries and frameworks, making it a flexible and efficient choice for modern web development.",
      "date": "9/2/2024",
      "userId": 5,
      "topicId": 4
    },
    {
      "id": 3,
      "title": "Wrapping your head around Python",
      "body": "Python is a high-level, interpreted programming language known for its simplicity and readability, making it an excellent choice for beginners and experienced developers alike. It supports multiple programming paradigms, including object-oriented, imperative, and functional programming. Python is widely used in fields such as web development, data analysis, artificial intelligence, machine learning, and automation. Its extensive standard library and large ecosystem of third-party packages allow developers to easily tackle a wide range of tasks. With a focus on clarity and ease of use, Python has become one of the most popular and versatile programming languages in the world.",
      "date": "1/9/2025",
      "userId": 4,
      "topicId": 5
    },
    {
      "id": 4,
      "title": "Brewing up some JavaScript",
      "body": "JavaScript is a versatile, high-level programming language primarily used for building interactive and dynamic features on websites. It runs in the browser, allowing developers to create responsive user interfaces, handle events, manipulate HTML and CSS, and interact with external data through APIs. As a core technology alongside HTML and CSS, JavaScript is essential for modern web development. It supports object-oriented, imperative, and functional programming styles, and with the rise of Node.js, it can also be used for server-side programming, making it a powerful tool for full-stack development.",
      "date": "1/2/2025",
      "userId": 2,
      "topicId": 3
    },
    {
      "id": 5,
      "title": "HTML Basics",
      "body": "HTML (HyperText Markup Language) is the standard language used to create and structure content on the web. It defines the elements of a webpage, such as headings, paragraphs, images, links, and forms, through a series of tags and attributes. HTML provides the basic framework for organizing content, making it accessible and navigable within a browser. While it focuses primarily on the structure and content, it works alongside CSS for styling and JavaScript for interactivity, forming the foundation of modern web development. HTML is essential for building any webpage or web application.",
      "date": "12/22/2024",
      "userId": 4,
      "topicId": 1
    },
    {
      "id": 6,
      "title": "Responding to React",
      "body": "At its core, React introduces a virtual DOM, which acts as an in-memory representation of the real DOM, enabling efficient updates and rendering. When the state or props of a component change, React performs a 'diffing' algorithm to compare the current virtual DOM with the previous one and only applies the minimal changes needed to the actual DOM. This reduces unnecessary re-renders and improves performance, especially in complex applications. React’s component-based architecture also promotes better code organization, modularity, and maintainability, with hooks like 'useState', 'useEffect', and 'useContext' providing powerful tools for managing state, side effects, and context across the app.",
      "date": "1/10/2025",
      "userId": 1,
      "topicId": 4
    },
    {
      "title": "JavaScript Diving Deeper",
      "body": "JavaScript is a high-level, interpreted programming language primarily used for building interactive and dynamic web applications. As a core technology of the web, alongside HTML and CSS, JavaScript enables client-side scripting, meaning it allows developers to create responsive user interfaces that can update in real-time without refreshing the page. Beyond its role in the browser, JavaScript also runs on the server-side via environments like Node.js, enabling full-stack development. It supports a variety of programming paradigms, including imperative, object-oriented, and functional programming. JavaScript's event-driven, non-blocking model, particularly with asynchronous programming using Promises and async/await, makes it well-suited for handling I/O-bound tasks, such as network requests. The language is constantly evolving, with ECMAScript specifications introducing new features, such as modern syntax (e.g., arrow functions, destructuring, and modules) and powerful APIs (e.g., Fetch, WebSockets, and Web Workers). Through frameworks and libraries like React, Angular, and Vue.js, JavaScript has become essential for building complex, scalable applications, while its vast ecosystem of tools and packages continues to drive innovation in the development world.",
      "date": "2025-01-14T22:29:03.938Z",
      "topicId": 3,
      "userId": 4,
      "id": 7
    },
    {
      "title": "HTML 101",
      "body": "HTML (Hypertext Markup Language) is the foundational language used to structure and present content on the web. It defines the skeleton of a webpage by marking up text, images, videos, and other elements with various tags, creating a document that browsers can interpret and render. HTML is not a programming language but a markup language, meaning its primary function is to organize and format content rather than dictate behavior. Over time, HTML has evolved significantly, with HTML5 introducing semantic elements like 'article', 'section', and 'header' to improve accessibility, SEO, and code readability. HTML5 also brought in native support for audio, video, and richer multimedia content without relying on external plugins, as well as APIs for geolocation, local storage, and offline web apps. Through the use of attributes, such as classes, ids, and data attributes, HTML allows developers to connect structure with CSS for styling and JavaScript for interactivity. As the backbone of web development, HTML plays a crucial role in ensuring that content is accessible and properly displayed across devices and platforms, supporting the creation of responsive and dynamic web applications.",
      "date": "2025-01-14T22:36:58.721Z",
      "topicId": 1,
      "userId": 3,
      "id": 8
    }
  ],
  "userLikedPosts": [
    {
      "id": 2,
      "userId": 1,
      "postId": 4
    },
    {
      "id": 3,
      "userId": 4,
      "postId": 1
    },
    {
      "id": 4,
      "userId": 3,
      "postId": 2
    },
    {
      "id": 5,
      "userId": 3,
      "postId": 4
    },
    {
      "id": 6,
      "userId": 1,
      "postId": 5
    },
    {
      "id": 7,
      "userId": 6,
      "postId": 2
    },
    {
      "userId": 6,
      "postId": 3,
      "id": 8
    },
    {
      "userId": 6,
      "postId": 6,
      "id": 9
    },
    {
      "userId": 6,
      "postId": 4,
      "id": 10
    },
    {
      "userId": 6,
      "postId": 5,
      "id": 11
    },
    {
      "userId": 4,
      "postId": 6,
      "id": 12
    },
    {
      "userId": 4,
      "postId": 2,
      "id": 13
    },
    {
      "userId": 3,
      "postId": 7,
      "id": 14
    },
    {
      "userId": 3,
      "postId": 3,
      "id": 15
    },
    {
      "userId": 3,
      "postId": 1,
      "id": 16
    },
    {
      "userId": 5,
      "postId": 7,
      "id": 18
    },
    {
      "userId": 2,
      "postId": 3,
      "id": 22
    },
    {
      "userId": 2,
      "postId": 6,
      "id": 23
    },
    {
      "userId": 2,
      "postId": 2,
      "id": 26
    },
    {
      "userId": 2,
      "postId": 8,
      "id": 27
    },
    {
      "userId": 2,
      "postId": 7,
      "id": 28
    },
    {
      "userId": 4,
      "postId": 8,
      "id": 29
    },
    {
      "userId": 1,
      "postId": 3,
      "id": 30
    },
    {
      "userId": 1,
      "postId": 7,
      "id": 31
    },
    {
      "userId": 1,
      "postId": 8,
      "id": 32
    },
    {
      "userId": 1,
      "postId": 2,
      "id": 33
    },
    {
      "userId": 1,
      "postId": 1,
      "id": 34
    },
    {
      "userId": 5,
      "postId": 3,
      "id": 35
    },
    {
      "userId": 5,
      "postId": 6,
      "id": 36
    }
  ]
}